{
  "entries": [
    {
      "title": "A Journal For You!",
      "content": "This app will allow you to make journal entries! Just give the entry a title and type away, whatever is on your mind!\n<br>\n<br>\nAfter you finish and click the button below, this post will be added below! All future entries will go in the same area, newest entry on top.\n<br>\n<br>\nIf you decide to reword any thoughts, or update a post with more thoughts, each post will have an edit button that will allow you to update your post!\n<br>\n<br>\nAnd finally, if any post ends up being a \"MySpace\"-like well of shame, there's a delete button convienently placed beside the edit button. It will permanently remove the post from existence so that your pride may remain intact!\n<br>\n<br>\nPlease enjoy this very basic app!\n",
      "date": "edited on: 08/08/2018 at 23:52:13 PM",
      "id": 1
    },
    {
      "title": "The Challenge of CRUD",
      "content": "C - creatable <br>\nR - readable  <br>\nU - updatable <br>\nD - deletable  <br>\n<br>\n<br>\nChallenges broken down: <br>\n<br>\n<br>\n1. Render a Form <br>\n2. If there are entries in the database already, render those below the form. <br>\n2. Once an Entry is finished being created, save it to a database. <br>\n3. Once that entry saves, render the Entry List from the database again so all entries show up. <br>\n4. Add an option to delete an entry, from the DOM and the database. <br>\n5. Make and entry editable, and save the changes to that entry on the database. <br>\n6. Use Grunt and Browserify to write modular code, readable, and control the above actions from the main js file. <br>\n7. Finally, style the page. <br>\n<br>\nDo this qualify as CRUD? I hope so!<br>",
      "date": "edited on: 08/09/2018 at 14:24:02 PM",
      "id": 2
    },
    {
      "title": "This is a simple test entry for jQuery conversion. v2.5",
      "content": "Hello! Welcome to the simple style of jQuery writing. v2.5",
      "date": "edited on: 08/09/2018 at 13:58:25 PM",
      "id": 3
    },
    {
      "title": "How are you doing today? 1.5",
      "content": "Fantastic! v2",
      "date": "edited on: 08/09/2018 at 15:18:38 PM",
      "id": 4
    }
  ]
}